config.org

Credit goes to Uncle Dave on Youtube for helping me set up my emacs config

* Initialize first
** package-list
#+BEGIN_SRC emacs-lisp
  (require 'package)
  (setq package-enable-at-startup nil)
  (setq package-archives '(("melpa"        . "https://melpa.org/packages/")
			   ("melpa-stable" . "https://stable.melpa.org/packages/")
			   ("gnu"          . "https://elpa.gnu.org/packages/")
			   ("nongnu"       . "https://elpa.nongnu.org/nongnu/")))

  (package-initialize)

  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (eval-and-compile
  (setq use-package-always-ensure t
	use-package-expand-minimally t))
  
  (require 'use-package)
#+END_SRC


* config edit/reload
** edit
#+BEGIN_SRC emacs-lisp
  (defun config-visit ()
    (interactive)
    (find-file "~/.emacs.d/config.org"))
  (global-set-key (kbd "C-c e") 'config-visit)
#+END_SRC
** reload
#+BEGIN_SRC emacs-lisp
  (defun config-reload ()
    (interactive)
    (org-babel-load-file (expand-file-name "~/.emacs.d/config.org")))
  (global-set-key (kbd "C-c r") 'config-reload)
#+END_SRC
* 'Fixing' Emacs
** Set emacs so that scratch buffer shows up instead of help screen
#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-message t)
#+END_SRC
** Prevent emacs from making backup files
#+BEGIN_SRC elisp
(setq make-backup-file nil)
#+END_SRC
** Get rid of lock mode.
#+BEGIN_SRC emacs-lisp
  (setq create-lockfiles nil)
#+END_SRC
** Prevent emacs from auto-saving
#+BEGIN_SRC emacs-lisp
(setq auto-save-default nil)
#+END_SRC
** Make yes or no prompts as simple as typing 'y' or 'n'
#+BEGIN_SRC emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC
** Adding '/usr/local/bin' to exec-path
#+BEGIN_SRC emacs-lisp
  (add-to-list 'exec-path "/usr/local/bin")
#+END_SRC
** Set default tramp method to ssh
#+BEGIN_SRC emacs-lisp
  (setq tramp-default-method "ssh")
#+END_SRC
** Use newlines  as a separator when appending and prepending to registers
#+BEGIN_SRC emacs-lisp
  (setq register-separator ?+)
  (set-register register-separator "\n\n")
#+END_SRC

** utf-8
#+begin_src emacs-lisp
  (prefer-coding-system 'utf-8)
#+end_src
** Relative line numbers
#+BEGIN_SRC emacs-lisp
  (setq display-line-numbers 'relative)
#+END_SRC

** Some preferred keybindings
** Set 'M-z' to zap-up-to-char
#+BEGIN_SRC emacs-lisp
  (global-set-key "\M-Z" 'zap-up-to-char)
#+END_SRC
** Split and follow function
#+BEGIN_SRC emacs-lisp
  (defun split-and-follow-horizontally ()
    "Splits a window horizontally and follows to opened window"
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1)
    )

  (defun split-and-follow-vertically ()
    "Splits a window vertically and follows to opened window"
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1)
    )

 (global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)
 (global-set-key (kbd "C-x 3") 'split-and-follow-vertically)
#+END_SRC
** Insert date and time easily

#+BEGIN_SRC emacs-lisp
  (defun mp-insert-date ()
    (interactive)
    (insert (format-time-string "%x")))

  (defun mp-insert-time ()
    (interactive)
    (insert (format-time-string "%X")))

  (global-set-key (kbd "C-c i d") 'mp-insert-date)
  (global-set-key (kbd "C-c i t") 'mp-insert-time)
#+END_SRC
** Copy rectangle region
#+BEGIN_SRC emacs-lisp
   (defun my-copy-rectangle (start end)
     "Copy the region-rectangle instead of `kill-rectangle'."
     (interactive "r")
     (delete-rectangle start end)
     (setq killed-rectangle (extract-rectangle start end)))

  (global-set-key (kbd "C-x r M-w") 'my-copy-rectangle)
#+END_SRC
* Preinstalled packages
** eshell
#+begin_src emacs-lisp
  (require 'eshell)
  (require 'em-smart)
  (setq eshell-where-to-jump 'begin)
  (setq eshell-review-quick-commands nil)
  (setq eshell-smart-space-goes-to-end t)
#+end_src
** ido-mode
#+BEGIN_SRC emacs-lisp
  (setq ido-enable-flex-matching t)
  (setq ido-create-new-buffer 'always)
  (setq ido-use-filename-at-point 'guess)
  (ido-mode 1)
  ;; (require 'ido)
  ;; (ido-mode t)
#+END_SRC
** Org
*** Org-mode keybindings
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)
(global-set-key (kbd "C-c b") 'org-switchb)
#+END_SRC

*** Require org-drill
#+BEGIN_SRC emacs-lisp
;; (require 'org-checklist)
#+END_SRC

*** Set org-log-done to true
#+BEGIN_SRC emacs-lisp
(setq org-log-done 'note)
#+END_SRC

*** Set org-mode agenda files
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-files '("~/gtd/inbox.org"
			   "~/gtd/gtd.org"
			   "~/gtd/tickler.org"))

#+END_SRC

*** Set priority range from A to C with default A
#+BEGIN_SRC emacs-lisp
  (setq org-highest-priority ?A)
  (setq org-lowest-priority ?C)
  (setq org-default-priority ?A)
#+END_SRC

*** Set colors for priorities
#+BEGIN_SRC emacs-lisp
  (setq org-priority-faces '((?A . (:foreground "#DC143C" :weight bold))
			     (?B . (:foreground "#FFA500"))
			     (?C . (:foreground "#48D1CC"))))
#+END_SRC

*** Org-mode templates
#+BEGIN_SRC emacs-lisp
  (setq org-capture-templates '(("t" "Todo [inbox]" entry
				 (file+headline "~/gtd/inbox.org" "Tasks")
				 "* TODO [#A] %i%?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n")
				("T" "Tickler" entry
				 (file+headline "~/gtd/tickler.org" "Tickler")
				 "* %i%? \n %U")))
#+END_SRC
*** open agenda in current window
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-window-setup (quote current-window))
#+END_SRC

*** Warn about any deadline in next 7 days
#+BEGIN_SRC emacs-lisp
  (setq org-deadline-warning-days 7)
#+END_SRC

*** Show tasks scheduled/due in next fortnight
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-span (quote fortnight))
#+END_SRC

*** Do not show tasks as scheduled if already shown as deadline
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-skip-scheduled-if-deadline-is-shown t)
#+END_SRC

*** Do not give warning colors to tasks w/ impending deadlines
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-skip-deadline-prewarning-if-scheduled (quote pre-scheduled))
#+END_SRC

*** Do not show tasks that are scheduled or have deadlines in normal todo list
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-todo-ignore-deadlines (quote all))
  (setq org-agenda-todo-ignore-scheduled (quote all))
#+END_SRC

*** How tasks should be sorted
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-sorting-strategy
	(quote
	 ((agenda deadline-up priority-down)
	  (todo priority-down category-keep)
	  (tags priority-down category-keep)
	  (search category-keep))))
#+END_SRC

*** org-refile targets
#+BEGIN_SRC emacs-lisp
  (setq org-refile-targets '(("~/gtd/gtd.org" :maxlevel . 3)
			     ("~/gtd/someday.org" :level . 1)
			     ("~/gtd/tickler.org" :maxlevel . 2)))
#+END_SRC
*** org-mode todo keywords
#+BEGIN_SRC emacs-lisp
(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "SOMEDAY(s)" "PROJ(p)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)")))
#+END_SRC

*** Turn off org-goto-auto-isearch
#+BEGIN_SRC emacs-lisp
  (setq org-goto-auto-isearch nil)

#+END_SRC
*** Set org-indent to 2
#+BEGIN_SRC emacs-lisp
  (setq org-list-indent-offset 2)
#+END_SRC
*** Save clock history across emacs sessions
#+BEGIN_SRC emacs-lisp
  (setq org-clock-persist 'history)
  (org-clock-persistence-insinuate)
#+END_SRC

*** Syntax highlight text in block
#+BEGIN_SRC emacs-lisp
  (setq org-src-fontify-natively t)
#+END_SRC
*** Maximum indentation for description lists
#+BEGIN_SRC emacs-lisp
  (setq org-list-description-max-indent 5)
#+END_SRC
*** prevent demoting heading
#+BEGIN_SRC emacs-lisp
  (setq org-adapt-indentation nil)

#+END_SRC

*** Have org-mode support programming languages
**** Python
#+begin_src emacs-lisp
  (use-package ob-python
    :defer t
    :ensure org-contrib
    :commands (org-babel-execute:python))
#+end_src

**** Shell
#+begin_src emacs-lisp
  (use-package ob-shell
    :defer t
    :ensure org-contrib
    :commands
    (org-babel-execute:sh
     org-babel-expand-body:sh

     org-babel-execute:bash
     org-babel-expand-body:bash))
#+end_src

**** C
#+begin_src emacs-lisp
  (use-package ob-C
    :defer t
    :ensure org-contrib
    :commands
    (org-babel-execute:C
     org-babel-expand-body:C))
#+end_src
**** R
#+begin_src emacs-lisp
  (use-package ob-R
    :defer t
    :ensure org-contrib
    :commands
    (org-babel-execute:R
     org-babel-expand-body:R))
#+end_src
**** ditaa
#+begin_src emacs-lisp
    (use-package ob-ditaa
      :defer t
      :ensure org-contrib
      :commands
      (org-babel-execute:ditaa
       org-babel-expand-body:ditaa))
#+end_src
**** gnuplot
#+begin_src emacs-lisp
      (use-package ob-gnuplot
	:defer t
	:ensure org-contrib
	:commands
	(org-babel-execute:gnuplot
	 org-babel-expand-body:gnuplot))
#+end_src
** Proced
#+begin_src emacs-lisp
  (defun proced-settings ()
    "Function for setting proced settings."
    (proced-toggle-auto-update))

  (add-hook 'proced-mode-hook 'proced-settings)
#+end_src
** Whitespace
#+BEGIN_SRC emacs-lisp
  (require 'whitespace)
  (setq whitespace-style '(face empty tabs lines-tail trailing))
  (global-whitespace-mode t)
#+END_SRC
* Extra Packages

** avy
#+BEGIN_SRC emacs-lisp
  (use-package avy
    :ensure t
    :bind (("C-:" . avy-goto-char)
	   ("C-'" . avy-goto-char-2)
	   ("M-g f" . avy-goto-line)
	   ("M-g w" . avy-goto-word-1)
	   ("M-g e" . avy-goto-word-0))
  )
#+END_SRC

** beacon
#+BEGIN_SRC emacs-lisp
(use-package beacon
  :ensure t
  :init
  (beacon-mode 1))
#+END_SRC

** Cider
    Package for clojure
#+BEGIN_SRC emacs-lisp
  ;; (use-package cider
  ;;  :ensure t)
#+END_SRC

