config.org
** Company
#+BEGIN_SRC emacs-lisp
  (use-package company
    :ensure t
    :hook (scala-mode . company-mode)
    :config
    (setq lsp-company-provider :capf)
    (setq company-idle-delay 0.5)
    (setq company-show-numbers t)
    (setq company-minimum-prefix-length 3)
    :bind (:map company-active-map
		("M-n" . nil)
		("M-p" . nil)
		("C-n" . company-select-next)
		("C-p" . company-select-previous)
		("M-<" . company-select-first)
		("M->" . company-select-last)
		("SPC" . company-abort))
    )

    (defun ora-company-number ()
      "Forward to `company-complete-number'.

       Unless the number is potentially part of the candidate.
       In that case, insert the number"
      (interactive)
      (let* ((k (this-command-keys))
	   (re (concat "^" command-prefix k)))
      (if (find-if (lambda (s) (string-match re s))
		      company-candidates)
	  (self-insert-command 1)
	(company-complete-number (string-to-number k)))))

  ;; (let ((map company-active-map))
  ;; (mapc (lambda (x) (define-key map (format "%d" x) 'ora-company-number))
  ;; 	(number-sequence 0 9))
  ;; (define-key map " " (lambda ()
  ;;                       (interactive)
  ;;                       (company-abort)
  ;;                       (self-insert-command 1)))
  ;; (define-key map (kbd "<return>") nil))

#+END_SRC
** Company-irony
#+BEGIN_SRC emacs-lisp
  (use-package company-irony
    :ensure t
    :after company
    :config
    (add-to-list 'company-backends 'company-irony)
    )
#+END_SRC
** Company-jedi
#+BEGIN_SRC emacs-lisp
  (use-package company-jedi
    :config
    (defun my/python-mode-hook ()
      (add-to-list 'company-backends 'company-jedi))

    (add-hook 'python-mode-hook 'my/python-mode-hook)
    :after company
  )
#+END_SRC
** Counsel
#+begin_src emacs-lisp
  (use-package counsel
    :ensure t
    :after (ivy swiper)
    :bind (("M-x" . counsel-M-x)
	   ("C-c j" . counsel-git-grep)
	   ("C-h b" . counsel-descbinds)
	   ("C-h f" . counsel-describe-function)
	   ("C-h v". counsel-describe-variable)
	   ("C-h a" . counsel-apropos)
	   ("C-h S" . counsel-info-lookup-symbol)
	   ("C-x r b" . counsel-bookmark)
	   ("C-x C-f" . counsel-find-file)
	   ("C-c P" . counsel-package)
	   ("C-r" . counsel-minibuffer-history)
	   :map minibuffer-local-map
	   ("C-r" . counsel-minibuffer-history)
	   :map shell-mode-map
	   ("C-r" . counsel-shell-history)))
#+end_src
** Debug Adapter Protocol
#+begin_src emacs-lisp
  (use-package dap-mode
    :after (lsp-mode)
    :hook
    (lsp-mode . dap-mode)
    (lsp-mode . dap-ui-mode)
    )
 #+end_src
** Exec-from-path-initialize
#+BEGIN_SRC emacs-lisp
;;  (use-package exec-path-from-shell
;;    :config
;;    (when (memq window-system '(mac ns x))
;;      (exec-path-from-shell-initialize))
;;    )
#+END_SRC
** Fly Check
#+begin_src emacs-lisp
  (use-package flycheck
    :init (global-flycheck-mode))
#+end_src
** Hydra
#+BEGIN_SRC emacs-lisp
  (use-package hydra
   :config
   (defhydra hydra-zoom (global-map "<f2>")
     "zoom"
     ("g" text-scale-increase "in")
     ("l" text-scale-decrease "out")))

  (global-set-key
   (kbd "C-n")
   (defhydra hydra-move
     (:body-pre (next-line))
     "move"
     ("n" next-line)
     ("p" previous-line)
     ("f" forward-char)
     ("F" forward-word)
     ("b" backward-char)
     ("B" backward-word)
     ("a" move-beginning-of-line)
     ("A" backward-sentence)
     ("e" move-end-of-line)
     ("E" forward-sentence)
     ("v" scroll-up-command)
     ("V" scroll-down-command)
     ("l" recenter-top-bottom)
     (">" end-of-buffer)
     ("<" beginning-of-buffer))
   )

#+END_SRC
** Ivy
#+BEGIN_SRC emacs-lisp
    (use-package ivy
      :ensure t
      :config
      (ivy-mode 1)
      :custom
      (ivy-use-virtual-buffers t)
      (ivy-height 10)
      (ivy-count-format "%d/%d ")
      (ivy-initial-inputs-alist nil)
      (ivy-rebuilders-alist '((t . ivy--regex-ignore-order)))
      :bind
      (("C-c C-r" . ivy-resume)
       ("C-x b" . ivy-switch-buffer)
       :map ivy-minibuffer-map
       ("C-n" . ivy-next-line))
  )


#+END_SRC

** htmlize
#+BEGIN_SRC emacs-lisp
;;  (use-package htmlize)
#+END_SRC

** lsp-mode
#+begin_src emacs-lisp
  (use-package lsp-mode
    :ensure
    :commands lsp
    :custom
    (lsp-rust-analyzer-cargo-watch-command "clippy")
    (lsp-eldoc-render-all t)
    (lsp-idle-delay 0.6)
    (lsp-rust-analyzer-server-display-inlay-hints t)
    :hook (scala-mode .lsp)
    (lsp-mode . lsp-lens-mode)
    :config
    (setq lsp-prefer-flymake nil))

#+end_src

** lsp-ui
#+begin_src emacs-lisp
  (use-package lsp-ui
    :ensure
    :after lsp
    :hook lsp-mode-hook
    :custom
    (lsp-ui-peek-always-show t)
    (lsp-ui-show-hover t)
    (lsp-ui-doc-enable t))
#+end_src
** lsp-metals
#+begin_src emacs-lisp
  (use-package lsp-metals
    :after lsp-mode)
 #+end_src

** Magit

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :ensure t
    :bind
    ("C-x g" . magit-status)
    ("C-x M-g" . magit-dispatch))
#+END_SRC
** Org Bullets
 #+BEGIN_SRC emacs-lisp
   (use-package org-bullets
     :ensure t
     :config
     (add-hook 'org-mode-hook (lambda () (org-bullets-mode))))
 #+END_SRC
** Paredit
#+begin_src emacs-lisp
  (use-package paredit
    :ensure t
    :hook ((emacs-lisp-mode-hook . paredit-mode)
	   (lisp-interaction-mode-hook . paredit-mode)
	   (ielm-mode-hook . paredit-mode)
	   (lisp-mode-hook . paredit-mode)
	   (eval-expression-minibuffer-setup-hook . paredit-mode))
    :bind (("C-M-u" . paredit-backward-up)
	   ("C-M-n" . paredit-forward-up)
	   ("M-S" . paredit-splice-sexp-killing-backward)
	   ("M-R" . paredit-raise-sexp)
	   ("M-(" . paredit-wrap-round)
	   ("M-[" . paredit-wrap-square)
	   ("M-{" . paredit-wrap-curly))
    :config
    (diminish 'paredit-mode "()"))
#+end_src
** Projectile
#+begin_src emacs-lisp
  (use-package projectile
    :ensure t
    :after (magit cider)
    :init
    (projectile-mode +1)
    :bind-keymap ("C-c p" . projectile-command-map)
    :bind (("C-x p" . projectile-mode-map)
	   :map projectile-mode-map
	   ("s-p" . projectile-command-map))
    :custom
    (projectile-create-missing-test-files t)
    (projectile-switch-projectile-action projectile-commander)
    :config
    (def-projectile-commander-method ?s
      "Open a *shell* buffer for the project."
      (projectile-run-shell))
    (def-projectile-commander-method ?c
      "Run `compile' in the project."
      (projectile-compile-project nil))

    (def-projectile-commander-method ?\C-?
      "Go back to project selection."
      (projectile-switch-project))

    (def-projectile-commander-method ?d
      "Open project root in dired."
      (projectile-dired))

    (def-projectile-commander-method ?F
      "Git fetch."
      (magit-status)
      (if (fboundp 'magit-fetch-from-upstream)
	  (call-interactively #'magit-fetch-from-upstream)
	(call-interactively #'magit-fetch-current)))

    (def-projectile-commander-method ?j
      "Jack-in."
      (let* ((opts (projectile-current-project-files))
	     (file (ido-completing-read
		    "Find file: "
		    opts
		    nil nil nil nil
		    (car (cl-member-if
			  (lambda (f)
			    (string-match "core\\.clj\\'" f))
			  opts)))))
	(find-file (expand-file-name
		    file (projectile-project-root)))
	(run-hooks 'projectile-find-file-hook)
	(cider-jack-in)))
    )
#+end_src
** Python mode
#+BEGIN_SRC emacs-lisp

  (use-package python-mode
    :custom
    (py-shell-name "ipython")
    (py-force-py-shell-name-p t)
    (py-switch-buffers-on-execute-p t)
    (py-smart-indentation t)
    (py-split-windows-on-execute-p nil)
    (py-python-command-args '("--gui=wx" "--pylab=wx" "-colors"))
    (py-smart-indentation t)
    :config
    (setq-default py-which-bufname "IPython"))



   ;;

#+END_SRC
** rainbow
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-mode
   :ensure t
   :init (rainbow-mode 1))

#+END_SRC

** Swiper
#+BEGIN_SRC emacs-lisp
  (use-package swiper
    :ensure t
    :after ivy
    :bind (("C-s" . swiper-isearch)))
#+END_SRC
** sbt-mode
#+begin_src emacs-lisp
  (use-package sbt-mode
:commands sbt-start sbt-command
:config
;; WORKAROUND: allows using SPACE when in the minibuffer
(substitute-key-definition
'minibuffer-complete-word
'self-insert-command
minibuffer-local-completion-map))
#+end_src
