config.org
** switch-window
    Package to switch windows more quickly; Pressing C-x o now brings up a menu of keys
    corresponding to the window one wants to switch to
#+BEGIN_SRC emacs-lisp
  (use-package switch-window
    :ensure t
    :config
    (setq switch-window-input-style 'minibuffer)
    (setq switch-window-increase 4)
    (setq switch-window-threshold 2)
    (setq switch-window-shortcut-style 'qwerty)
    (setq switch-window-qwerty-shortcuts
	  '("a" "s" "d" "f" "j" "k" "l"))
    :bind
    ([remap other-window] . switch-window))

#+END_SRC
** paradox
#+begin_src emacs-lisp
  (use-package paradox
    :config
    (paradox-enable)
  )
#+end_src
** popup-kill-ring
#+BEGIN_SRC emacs-lisp
  (use-package popup-kill-ring
    :ensure t
    :bind ("M-y" . popup-kill-ring)
    :config
    (setq save-interprogram-paste-before-kill t))

#+END_SRC
** unicode
#+begin_src emacs-lisp
  (use-package unicode-fonts
    :ensure t
    :config
    (unicode-fonts-setup))
#+end_src
** which-key
#+BEGIN_SRC emacs-lisp
(use-package which-key
  :ensure t
  :init
  (which-key-mode))
#+END_SRC

** Yasnippet
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :ensure t
    :config
    (use-package yasnippet-snippets
      :ensure t)
    (yas-reload-all)
    (yas-global-mode 1))

#+END_SRC
* Aesthetic Changes
** Change default tab-with to 4 spaces
#+BEGIN_SRC emacs-lisp
  (setq default-tab-width 4)
#+END_SRC
** Getting rid of all bars
#+BEGIN_SRC emacs-lisp
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
#+END_SRC
** Change modeline
#+BEGIN_SRC emacs-lisp
  (column-number-mode 1)
  (set-face-attribute 'mode-line nil :background "light blue")
  (set-face-attribute 'mode-line-buffer-id nil :background "blue" :foreground)
  (defface mode-line-directory
    '((t : background "blue" :foreground "gray"))
    "Face used for buffer identification parts of the mode line."
    :group 'mode-line-faces
    :group 'basic-faces)

  (set-face-attribute 'mode-line-highlight nil :box nil :background "deep sky blue")
  (set-face-attribute 'mode-line-inactive nil :inherit 'default)

  (setq mode-line-position
	'((line-number-mode ("%l" (column-number-mode ":%c")))))

  (defun shorten-directory (dir max-length)
    "Show up to `max-length' characters of a directory name `dir'."
    (let ((path (reverse (split-string (abbreviate-file-name dir) "/")))
	  (output ""))
      (when (and path (equal "" (car path)))
	(setq path (cdr path)))
      (while (and path (< (length output) (- max-length 4)))
	(setq output (concat (car path) "/" output))
	(setq path (cdr path)))
      (when path
	(setq output (concat ".../" output)))
      output))

  (defvar mode-line-directory
    '(:propertize
      (:eval (if (buffer-file-name) (concat " " (shorten-directory default-directory 20)) " "))
      face mode-line-directory)
    "Formats the current directory.")
  (put 'mode-line-directory 'risky-local-variable t)

  (setq-default mode-line-buffer-identification
		(propertized-buffer-identification "%b "))

  (setq-default mode-line-format
		'("%e"
		  mode-line-front-space
		  ;; mode-line-mule-info --
		  mode-line-client
		  mode-line-modified
		  ;; mode-line-remote -- no need to indicate this specially
		  ;; mode-line-frame-identification
		  " "
		  mode-line-directory
		  mode-line-buffer-identication
		  " "
		  mode-line-position
		  (flycheck-mode flycheck-mode-line)
		  " "
		  mode-line-modes
		  mode-line-misc-info
		  mode-line-end-spaces))
#+END_SRC
** Highlight current line
#+BEGIN_SRC emacs-lisp
(when window-system (global-hl-line-mode t))
#+END_SRC
** Prettify symbols
#+BEGIN_SRC emacs-lisp
(when window-system (global-prettify-symbols-mode t))

(setq prettify-symbols-unprettify-at-point 'right-edge)
#+END_SRC

#+END_SRC
** Make emacs theme moe
#+BEGIN_SRC emacs-lisp
(unless (package-installed-p 'moe-theme)
  (package-refresh-contents)
  (package-install 'moe-theme))

(require 'moe-theme)
(moe-dark)
#+END_SRC
* Language-Specific Settings
** C
#+BEGIN_SRC emacs-lisp
  (setq-default c-basic-offset 4)
#+END_SRC
** Clojure
#+BEGIN_SRC emacs-lisp
  (use-package cider)
#+END_SRC
** Common Lisp
#+begin_src emacs-lisp
  ;; (global-set-key (kbd "C-c e l") #'find-library)
  (setq inferior-lisp-program "/usr/local/bin/sbcl")

  (setq library-lisp-implementations '((sbcl ("sbcl")))
	slime-default-lisp 'sbcl
	slime-contribs '(slime-fancy))

  (use-package paren-face
    :defer)

  (defun my-emacs-lisp-mode-hook-fn ()
    (set (make-local-variable 'lisp-indent-function) #'lisp-indent-function)
    (local-set-key (kbd "C-c S") (global-key-binding (kbd "M-s")))
    (show-paren-mode 1)
    (paren-face-mode)
    )

  (use-package slime-company
    :defer)

  (use-package slime
    :demand
    :config
    (slime-setup '(slime-fancy slime-company slime-cl-indent)))


#+end_src
** Java
#+begin_src emacs-lisp
  (add-to-list 'file-name-handler-alist '("\\.class$" . javap-handler))

  (defun javap-handler (op &rest args)
    "Handle .class files by putting the output of javap in the buffer."
    (cond
     ((eq op 'get-file-buffer)
      (let ((file (car args)))
	(with-current-buffer (create-file-buffer file)
	  (call-process "javap" nil (current-buffer) nil "-verbose"
			"-classpath" (file-name-directory file)
			(file-name-sans-extension
			 (file-name-nondirectory file)))
	  (setq buffer-file-name file)
	  (setq buffer-read-only t)
	  (set-buffer-modified-p nil)
	  (goto-char (point-min))
	  (java-mode)
	  (current-buffer))))
     ((javap-handler-real op args))))

  (defun javap-handler-real (operation args)
    "Run the real handler without the javap handler installed."
    (let ((inhibit-file-name-handlers
	   (cons 'javap-handler
		 (and (eq inhibit-file-name-operation operation)
		      inhibit-file-name-handlers)))
	  (inhibit-file-name-operation operation))
      (apply operation args)))

#+end_src

** Scala
#+begin_src emacs-lisp
  (use-package scala-mode
    :mode "\\.\\(sc\\|scala\\)|\\'"
    :interpreter
    ("scala" . scala-mode))

  (use-package sbt-mode
    :commands sbt-start sbt-command
    :config
    (substitute-key-definition
     'minibuffer-complete-word
     'self-insert-command
     minibuffer-local-completion-map)
    (setq sbt:program-options '("-Dsbt.supershell=false"))
    )
#+end_src
* Terminal
** Setting default shell to bash
#+BEGIN_SRC emacs-lisp
  (defvar my-term-shell "/bin/bash")
  (defadvice ansi-term (before force-bash)
    (interactive (list my-term-shell)))
  (ad-activate 'ansi-term)
#+END_SRC
